package com.example.kotlin_test

private val dobleList: List<MutableList<String>> = arrayListOf(
    mutableListOf("이브이", "풀", "잠만보", "블루베리", "모르페코", "조개", "마자용", "기라티나"),
    mutableListOf("포니타", "번개", "불", "울머기", "코일", "님피아", "이상해씨", "블루베리"),
    mutableListOf("잠만보", "야돈", "몬스터볼", "파이리", "나몰빼미", "팬텀", "울머기", "루카리오"),
    mutableListOf("몬스터볼", "흥나숭", "이상해씨", "이브이", "멍파치", "지우", "마기라스", "토게데마루"),
    mutableListOf("님피아", "토게피", "팬텀", "마자용", "피카츄", "멍파치", "물", "배"),
    mutableListOf("우르", "기라티나", "이상해씨", "따라큐", "물", "나옹", "나몰빼미", "메타몽"),
    mutableListOf("몬스터볼", "흥나숭", "이상해씨", "이브이", "멍파치", "지우", "마기라스", "토게데마루"),
    mutableListOf("피카츄", "파이리", "블래키", "나옹", "지우", "모르페코", "꼬부기", "번개"),
    mutableListOf("토게피", "핫삼", "기라티나", "뮤", "꼬부기", "한카리아스", "몬스터볼"),
    mutableListOf("갸라도스", "우르", "모르페코", "팬텀", "염버니", "토게데마루", "불", "망나뇽"),
    mutableListOf("에이스번", "루카리오", "피카츄", "코일", "기라티나", "갸라도스", "마기라스", "로토무"),
    mutableListOf("이븐곰", "꼬부기", "망나뇽", "블루베리", "나몰빼미", "버터풀", "마기라스", "배"),
    mutableListOf("한카리아스", "뮤츠", "아르세우스", "멍파치", "나몰빼미", "모르페코", "푸린", "코일"),
    mutableListOf("마자용", "나몰빼미", "포니타", "마박사", "뮤", "블래키", "토게데마루", "로토무"),
    mutableListOf("마기라스", "한카리아스", "조개", "번개", "마스터볼", "메타몽", "마박사", "팬텀"),
    mutableListOf("글레이시아", "몬스터볼", "포니타", "버터풀", "에이스번", "마스터볼", "에이스번", "물"),
    mutableListOf("울머기", "지우", "뮤츠", "배", "에이스번", "우르", "조개", "뮤"),
    mutableListOf("이븐곰", "에이스번", "멍파치", "야돈", "풀", "마박사", "불", "나옹"),
    mutableListOf("뮤츠", "고라파덕", "토게데마루", "블루베리", "루카리오", "나옹", "토게피", "마스터볼"),
    mutableListOf("이상해씨", "배", "펭도리", "루카리오", "모르페코", "마박사", "세레비", "핫삼"),
    mutableListOf("야돈", "이브이", "포니타", "피카츄", "망나뇽", "핫삼", "메타몽", "뮤츠"),
    mutableListOf("나옹", "포니타", "갸라도스", "흥나숭", "배", "한카리아스", "렌트라", "잠만보"),
    mutableListOf("에이스번", "블루베리", "푸린", "팬텀", "핫삼", "흥나숭", "따라큐", "블래키"),
    mutableListOf("뮤", "잠만보", "염버니", "피카츄", "이상해씨", "푸린", "이븐곰", "마스터볼"),
    mutableListOf("메타몽", "파이리", "블루베리", "멍파치", "글레이시아", "펭도리", "갸라도스", "뮤"),
    mutableListOf("나몰빼미", "마스터볼", "풀", "리자몽", "지우", "님피아", "핫삼", "갸라도스"),
    mutableListOf("따라큐", "갸라도스", "마자용", "뮤츠", "세레비", "이븐곰", "번개", "몬스터볼"),
    mutableListOf("마스터볼", "코일", "야돈", "흥나숭", "펭도리", "우르", "마자용", "꼬부기"),
    mutableListOf("풀", "마기라스", "우르", "파이리", "푸린", "포니타", "토게피", "세레비"),
    mutableListOf("블루베리", "야돈", "로토무", "한카리아스", "염버니", "세레비", "지우", "물"),
    mutableListOf("울머기", "나옹", "마기라스", "아르세우스", "마자용", "글레이시아", "핫삼", "염버니"),
    mutableListOf("푸린", "야돈", "배", "리자몽", "기라티나", "토게데마루", "번개", "글레이시아"),
    mutableListOf("흥나숭", "마박사", "글레이시아", "염버니", "뮤츠", "파이리", "기라티나", "버터풀"),
    mutableListOf("토게피", "야돈", "조개", "버터풀", "아르세우스", "이상해씨", "갸라도스", "블래키"),
    mutableListOf("토게데마루", "풀", "울머기", "따라큐", "피카츄", "펭도리", "한카리아스", "버터풀"),
    mutableListOf("풀", "코일", "배", "메타몽", "염버니", "고라파덕", "블래키", "몬스터볼"),
    mutableListOf("고라파덕", "마자용", "한카리아스", "파이리", "망나뇽", "에이스번", "리자몽", "이상해씨"),
    mutableListOf("푸린", "메타몽", "루카리오", "불", "지우", "마자용", "렌트라", "버터풀"),
    mutableListOf("이상해씨", "뮤츠", "로토무", "글레이시아", "렌트라", "풀", "꼬부기", "팬텀"),
    mutableListOf("잠만보", "토게데마루", "님피아", "꼬부기", "아르세우스", "에이스번", "메타몽", "세레비"),
    mutableListOf("루카리오", "뮤", "물", "풀", "아르세우스", "망나뇽", "번개", "흥나숭"),
    mutableListOf("몬스터볼", "마박사", "피카츄", "렌트라", "우르", "블루베리", "아르세우스", "리자몽"),
    mutableListOf("따라큐", "렌트라", "마기라스", "모르페코", "고라파덕", "님피아", "야돈", "뮤"),
    mutableListOf("마스터볼", "불", "아르세우스", "이브이", "파이리", "배", "로토무", "따라큐"),
    mutableListOf("블래키", "세레비", "렌트라", "기라티나", "마스터볼", "울머기", "멍파치", "망나뇽"),
    mutableListOf("따라큐", "염버니", "포니타", "조개", "루카리오", "꼬부기", "리자몽", "멍파치"),
    mutableListOf("염버니", "번개", "이브이", "나몰빼미", "에이스번", "토게피", "펭도리", "렌트라"),
    mutableListOf("잠만보", "펭도리", "뮤츠", "물", "블래키", "마기라스", "불", "리자몽"),
    mutableListOf("푸린", "마박사", "갸라도스", "물", "꼬부기", "울머기", "고라파덕", "이브이"),
    mutableListOf("나몰빼미", "세레비", "불", "글레이시아", "흥나숭", "고라파덕", "피카츄", "조개"),
    mutableListOf("메타몽", "모르페코", "흥나숭", "이븐곰", "로토무", "리자몽", "울머기", "토게피"),
    mutableListOf("물", "토게데마루", "코일", "이븐곰", "파이리", "조개", "핫삼", "렌트라"),
    mutableListOf("세레비", "코일", "나옹", "팬텀", "이브이", "버터풀", "뮤", "리자몽"),
    mutableListOf("망나뇽", "코일", "토게피", "따라큐", "지우", "글레이시아", "마박사", "잠만보"),
    mutableListOf("몬스터볼", "조개", "나옹", "님피아", "로토무", "펭도리", "망나뇽", "푸린"),
    mutableListOf("이브이", "블래키", "님피아", "이븐곰", "우르", "한카리아스", "글레이시아", "루카리오"),
)


fun main() {

    val set = mutableSetOf<String>()
    dobleList.forEach {
        it.forEach { str ->
            set.add(str)
        }
    }
    val map = hashMapOf<Int, String>()
    set.forEachIndexed { index, str ->
        map[index] = str
    }
//    println("set : ${set.sorted()}")
    println("map : $map")

    println("set size : ${set.size}")
    println("map size : ${map.size}")

}

